In [1]:
import pandas as pd
import numpy as np

In [2]:
array_a=np.array([[3,2,1],[6,3,2]])

In [3]:
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [4]:
type(pd.DataFrame(array_a))

pandas.core.frame.DataFrame

In [5]:
df=pd.DataFrame(array_a,columns=['Column 1','Column 2', 'Column 3'])
df

   Column 1  Column 2  Column 3
0         3         2         1
1         6         3         2

In [12]:
data=pd.read_csv("Sample-Val.csv", index_col="Date")
lead_co_data=data.copy()
lead_co_data

,Description,Account,Amount
Date,,,
24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000.0
30-09-2013,Interest Deposit,savings for me and Bro,7.0
10-10-2013,Miscellaneous Deposit,savings for me and Bro,30000.0
10-10-2013,Miscellaneous Deposit,savings for me and Bro,2500.0
15-10-2013,Miscellaneous Deposit,savings for me and Bro,1.0
30-11-2013,User added funds from SBA-9978,savings for me and Bro,10000.0
05-12-2013,User added funds from SBA-9978,savings for me and Bro,100.0
31-12-2013,Interest Deposit,savings for me and Bro,739.0
01-01-2014,User added funds from SBA-9978,savings for me and Bro,1000.0
05-01-2014,User added funds from SBA-9978,savings for me and Bro,1000.0
04-02-2014,User added funds from SBA-9978,savings for me and Bro,5000.0
27-02-2014,User added funds from SBA-9978,savings for me and Bro,4653.0

In [13]:
type(lead_co_data)

pandas.core.frame.DataFrame

<b>Common Attributes for Working with Data Frames

In [14]:
lead_co_data.head()

,Description,Account,Amount
Date,,,
24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000.0
30-09-2013,Interest Deposit,savings for me and Bro,7.0
10-10-2013,Miscellaneous Deposit,savings for me and Bro,30000.0
10-10-2013,Miscellaneous Deposit,savings for me and Bro,2500.0
15-10-2013,Miscellaneous Deposit,savings for me and Bro,1.0

In [15]:
lead_co_data.columns

Index([' Description', ' Account', ' Amount'], dtype='object')

In [16]:
type(lead_co_data)

pandas.core.frame.DataFrame

In [17]:
lead_co_data.axes

[Index(['24-09-2013', '30-09-2013', '10-10-2013', '10-10-2013', '15-10-2013',
        '30-11-2013', '05-12-2013', '31-12-2013', '01-01-2014', '05-01-2014',
        '04-02-2014', '27-02-2014'],
       dtype='object', name='Date'),
 Index([' Description', ' Account', ' Amount'], dtype='object')]

In [18]:
lead_co_data.dtypes

 Description     object
 Account         object
 Amount         float64
dtype: object

In [19]:
lead_co_data.values

array([['Initial deposit for goal creation from SBA-9978',
        'savings for me and Bro', 5000.0],
       ['Interest Deposit', 'savings for me and Bro', 7.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 30000.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 2500.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 1.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        10000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        100.0],
       ['Interest Deposit', 'savings for me and Bro', 739.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        1000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        1000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        5000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        4653.0]], dtype=object)

In [20]:
lead_co_data.to_numpy()

array([['Initial deposit for goal creation from SBA-9978',
        'savings for me and Bro', 5000.0],
       ['Interest Deposit', 'savings for me and Bro', 7.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 30000.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 2500.0],
       ['Miscellaneous Deposit', 'savings for me and Bro', 1.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        10000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        100.0],
       ['Interest Deposit', 'savings for me and Bro', 739.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        1000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        1000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        5000.0],
       ['User added funds from SBA-9978', 'savings for me and Bro',
        4653.0]], dtype=object)

In [21]:
lead_co_data.shape

(12, 3)

<h4><b>Data Selection in Pandas Data Frames</b></h4>

In [24]:
 lead_co_data.head()

,Description,Account,Amount
Date,,,
24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000.0
30-09-2013,Interest Deposit,savings for me and Bro,7.0
10-10-2013,Miscellaneous Deposit,savings for me and Bro,30000.0

In [43]:
data=pd.read_csv("Sample-Val.csv")
lead_co_data=data.copy()
lead_co_data

,Date,Description,Account,Amount,Maturity
0,24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000,25
1,30-09-2013,Interest Deposit,savings for me and Bro,7,15
2,10/10/2013,Miscellaneous Deposit,savings for me and Bro,30000,33
3,10/10/2013,Miscellaneous Deposit,savings for me and Bro,2500,10
4,15-10-2013,Miscellaneous Deposit,savings for me and Bro,1,15
5,30-11-2013,User added funds from SBA-9978,savings for me and Bro,10000,17
6,5/12/2013,User added funds from SBA-9978,savings for me and Bro,100,19
7,31-12-2013,Interest Deposit,savings for me and Bro,739,24
8,1/1/2014,User added funds from SBA-9978,savings for me and Bro,1000,12
9,5/1/2014,User added funds from SBA-9978,savings for me and Bro,1000,13
10,4/2/2014,User added funds from SBA-9978,savings for me and Bro,5000,14
11,27-02-2014,User added funds from SBA-9978,savings for me and Bro,4653,18

In [44]:
lead_co_data.Date

0     24-09-2013
1     30-09-2013
2     10/10/2013
3     10/10/2013
4     15-10-2013
5     30-11-2013
6      5/12/2013
7     31-12-2013
8       1/1/2014
9       5/1/2014
10      4/2/2014
11    27-02-2014
Name: Date, dtype: object

In [39]:
lead_co_data['Date'].head(3) #Only Date is working here, Not Sure

0    24-09-2013
1    30-09-2013
2    10-10-2013
Name: Date, dtype: object

In [42]:
type(lead_co_data['Date'])

pandas.core.series.Series

In [47]:
lead_co_data[['Maturity', 'Date']].head()

   Maturity        Date
0        25  24-09-2013
1        15  30-09-2013
2        33  10/10/2013
3        10  10/10/2013
4        15  15-10-2013

<b>Indexing with ILOC</b>

In [48]:
lead_co_data.iloc[0]

Date                                                 24-09-2013
 Description    Initial deposit for goal creation from SBA-9978
 Account                                 savings for me and Bro
 Amount                                                    5000
Maturity                                                     25
Name: 0, dtype: object

In [49]:
lead_co_data.iloc[1]

Date                        30-09-2013
 Description          Interest Deposit
 Account        savings for me and Bro
 Amount                              7
Maturity                            15
Name: 1, dtype: object

In [50]:
lead_co_data.iloc[1,3] #AMount here printed for 1st Index

7

In [55]:
lead_co_data.iloc[1,:]

Date                        30-09-2013
 Description          Interest Deposit
 Account        savings for me and Bro
 Amount                              7
Maturity                            15
Name: 1, dtype: object

In [56]:
lead_co_data.iloc[:,3]

0      5000
1         7
2     30000
3      2500
4         1
5     10000
6       100
7       739
8      1000
9      1000
10     5000
11     4653
Name:  Amount, dtype: int64

In [57]:
type(lead_co_data.iloc[:,3])

pandas.core.series.Series

In [58]:
type(lead_co_data.iloc[1,3])

numpy.int64

In [59]:
lead_co_data.iloc[[1,3],:]

,Date,Description,Account,Amount,Maturity
1,30-09-2013,Interest Deposit,savings for me and Bro,7,15
3,10/10/2013,Miscellaneous Deposit,savings for me and Bro,2500,10

In [60]:
lead_co_data.iloc[:,[3,1]]

     Amount                                      Description
0      5000  Initial deposit for goal creation from SBA-9978
1         7                                 Interest Deposit
2     30000                            Miscellaneous Deposit
3      2500                            Miscellaneous Deposit
4         1                            Miscellaneous Deposit
5     10000                   User added funds from SBA-9978
6       100                   User added funds from SBA-9978
7       739                                 Interest Deposit
8      1000                   User added funds from SBA-9978
9      1000                   User added funds from SBA-9978
10     5000                   User added funds from SBA-9978
11     4653                   User added funds from SBA-9978

<b>Indexing with LOC</b>

In [61]:
data=pd.read_csv("Sample-Val.csv",index_col="Maturity")
lead_co_data=data.copy()

In [64]:
lead_co_data.sort_index()

,Date,Description,Account,Amount
Maturity,,,,
10,10/10/2013,Miscellaneous Deposit,savings for me and Bro,2500
12,1/1/2014,User added funds from SBA-9978,savings for me and Bro,1000
13,5/1/2014,User added funds from SBA-9978,savings for me and Bro,1000
14,4/2/2014,User added funds from SBA-9978,savings for me and Bro,5000
15,30-09-2013,Interest Deposit,savings for me and Bro,7
15,15-10-2013,Miscellaneous Deposit,savings for me and Bro,1
17,30-11-2013,User added funds from SBA-9978,savings for me and Bro,10000
18,27-02-2014,User added funds from SBA-9978,savings for me and Bro,4653
19,5/12/2013,User added funds from SBA-9978,savings for me and Bro,100
24,31-12-2013,Interest Deposit,savings for me and Bro,739
25,24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000
33,10/10/2013,Miscellaneous Deposit,savings for me and Bro,30000

In [74]:
lead_co_data.loc[17]

Date                                30-11-2013
 Description    User added funds from SBA-9978
 Account                savings for me and Bro
 Amount                                  10000
Name: 17, dtype: object

In [81]:
lead_co_data.loc[17,'Date']

'30-11-2013'

In [82]:
lead_co_data.loc[:,'Date']

Maturity
25    24-09-2013
15    30-09-2013
33    10/10/2013
10    10/10/2013
15    15-10-2013
17    30-11-2013
19     5/12/2013
24    31-12-2013
12      1/1/2014
13      5/1/2014
14      4/2/2014
18    27-02-2014
Name: Date, dtype: object

<b>A few COmments on Loc and Iloc</b>

In [83]:
lead_co_data.shape

(12, 4)

In [89]:
lead_co_data_sorted=lead_co_data.sort_index().copy()
lead_co_data_sorted

,Date,Description,Account,Amount
Maturity,,,,
10,10/10/2013,Miscellaneous Deposit,savings for me and Bro,2500
12,1/1/2014,User added funds from SBA-9978,savings for me and Bro,1000
13,5/1/2014,User added funds from SBA-9978,savings for me and Bro,1000
14,4/2/2014,User added funds from SBA-9978,savings for me and Bro,5000
15,30-09-2013,Interest Deposit,savings for me and Bro,7
15,15-10-2013,Miscellaneous Deposit,savings for me and Bro,1
17,30-11-2013,User added funds from SBA-9978,savings for me and Bro,10000
18,27-02-2014,User added funds from SBA-9978,savings for me and Bro,4653
19,5/12/2013,User added funds from SBA-9978,savings for me and Bro,100
24,31-12-2013,Interest Deposit,savings for me and Bro,739
25,24-09-2013,Initial deposit for goal creation from SBA-9978,savings for me and Bro,5000
33,10/10/2013,Miscellaneous Deposit,savings for me and Bro,30000

In [90]:
lead_co_data_sorted.iloc[:,-1]

Maturity
10     2500
12     1000
13     1000
14     5000
15        7
15        1
17    10000
18     4653
19      100
24      739
25     5000
33    30000
Name:  Amount, dtype: int64

In [91]:
lead_co_data_sorted.iloc[-1,:]

Date                        10/10/2013
 Description     Miscellaneous Deposit
 Account        savings for me and Bro
 Amount                          30000
Name: 33, dtype: object

In [92]:
lead_co_data_sorted['Date'].iloc[0]

'10/10/2013'

In [95]:
lead_co_data_sorted['Date'][25]

'24-09-2013'

In [97]:
lead_co_data_sorted.loc[:,'Date'].iloc[[0,5]]

Maturity
10    10/10/2013
15    15-10-2013
Name: Date, dtype: object